---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures
source: html/a2d4639f-2abb-0ade-39e4-4a84b725247f.htm
---
# BuiltInFailures.PartMakerMethodForWallFailures Properties

Failed to extend or trim some layer at an end join